#pragma once
/*
**********************************************************************
* 模块名称: USER_ALG
* 摘    要: 算法类
* 当前版本: 1.0
* 作    者: guangjie2333
* 完成日期: 2021-10-22
* 内    容:
* 注    意: none
*********************************************************************/


/*
**********************************************************************
*                               包含头文件
**********************************************************************
*/
#include "USER_DEFINE.h"

/*
**********************************************************************
*                               用户字定义类
**********************************************************************
*/
class USER_ALG
{
	//variable 
	public:

	protected:

	private:
	

	//function
	public:
		void QuickSort(int* A, int N);//快速排序
		void Swap(int* a, int* b);//交换两个数
		
	protected:
		
	private:
		void Qsort(int* A, int left, int right);
		int Median3(int* A, int left, int right);
};

